In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv(r"CSV/customer_data.csv")

In [3]:
data.head()

   customer_id  age gender            email  purchases
0         1001   35      M  abc@example.com       10.0
1         1002   28      F  def@example.com        5.0
2         1003   40      F  ghi@example.com        NaN
3         1004   45      M  jkl@example.com        8.0
4         1005   33      M  mno@example.com       15.0

In [12]:
data.isnull().sum()

customer_id    0
age            0
gender         0
email          0
purchases      2
dtype: int64

In [13]:
data.dropna(subset=['purchases'], inplace=True)

In [14]:
data.isnull().sum()

customer_id    0
age            0
gender         0
email          0
purchases      0
dtype: int64

In [11]:
data.duplicated().sum() #Since there are no duplicates found no need to handle duplicates

0

In [15]:
average_purchases_by_gender = data.groupby('gender')['purchases'].mean()

In [16]:
average_purchases_by_gender

gender
F     7.00
M    11.25
Name: purchases, dtype: float64